package com.green.day14.ch6;

public class Day14Memo {
    //지역변수와 전역변수의 이름이 같으면 가장 가까운 변수를 호출한다.
    //전역변수는 객체가 살아있는동안 계속 살아있다.
    //지역변수는 호출이 끝나고 나면 값이 사라진다.
    //this.은 주소값 메소드를 호출할때 사용한다.
    //this ()는 생성자를 호출 할때 사용한다.
    //private는 같은 클래스에서만 사용가능.
    //static은 this.을 사용 할 수 없다.
    //호출식이 정확한 값도 없고 =가 없으면 void 메소드이다.
    //기본생성자. 기본생성자는 파라미터가 없다.
    //생성자의 이름은 클래스의 이름과 같다
    //생성자는 리턴값이 없다.
    //생성자가 하나도 없을때 컴파일러가 기본생성자를 자동으로 넣어준다.
    //기본생성자와 파라미터 생성자를 같이 쓰고 싶으면 둘다 입력 해야한다.

    //기본 생성자의 존재이유
    //1 멤버필드 값을 객체생성과 동시에 밀어넣을 수 있다.
    //2 객체를 생성할 수 있다.
}
